#+TITLE:     The Org-article LaTeX class
#+AUTHOR:    Tom Dye
#+EMAIL:     tsd at tsdye dot com
#+DATE:      2010-09-18 Sat
#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 
#+BABEL: :exports code
#+LaTeX_CLASS: org-article
#+LaTeX_CLASS_OPTIONS: [koma,letterpaper,fontset=bera,11pt,source=listings,microtype,lists=inparai,colorlinks=true,urlcolor=blue,secnum=section,gantt]
#+LATEX_HEADER: \usepackage[AUTO]{inputenc}


#+BEGIN_abstract
This document contains the code and documentation for the [[latex:classfile][Org-article]]
LaTeX class.  The [[latex:classfile][Org-article]] class is designed to work with the
output of the [[latex:proglang][Org-mode]] LaTeX exporter.  It offers some features
that might make it easy for non-programmers or LaTeX novices to use:
  4. self-contained configuration;
  1. several choices of fonts;
  2. flexible arrangement of the abstract, table of contents, and
     lists of tables, figures, and source code listings; 
  3. semantic markup in the domain of computer programming;  and
  4. a common interface for syntax highlighting and typesetting source
     code blocks.  
The pdf version of this document is created with the [[latex:classfile][Org-article]] class
     directly from the [[latex:proglang][Org-mode]] source document, without any
     subsequent tweaking of the LaTeX export.
#+END_abstract

#+LATEX: \tableofcontents
#+LATEX: \listoftables
#+LATEX: \listoffigures
#+LATEX: \listoflistings

**** Preparing the input table

  Table \ref{tab:gantt} describes the tasks and other relevant
  information for a project.  Each line is an /entry/ and there are
  three types of entry allowed in this table:

  - task :: an actual task that has a start time, a duration and an end time
  - milestone :: a specific milestone in the project that has a start
               time alone
  - date :: a point in time that will be drawn as a vertical line in the
          GANTT chart (e.g., start of each year)

  Each element of the chart will be annotated with the content of the
  /label/ column of each entry.  The first column of the table is
  ignored but I use it to number the entries.  The last column, titled
  /align/, is used to determine where to place the /activity/ text for
  tasks, whether to the left or right of the bar or, if nothing is
  specified, centred within the bar itself.

#+CAPTION: The GANTT chart input table
#+LABEL: tab:gantt
#+tblname: gantttesttable
    |    | type      | label | activity      | depends | start | duration | end | align |
    |----+-----------+-------+---------------+---------+-------+----------+-----+-------|
    |  1 | date      | Start |               |         |     0 |          |   0 |       |
    |  2 | task      | 1.1   | Lit survey    |         |     0 |        3 |   3 | right |
    |  3 | task      | 1.2   | Develop model |       2 |     3 |        9 |  12 | right |
    |  4 | milestone | M1    | model         |       3 |    12 |          |  12 |       |
    |  5 | task      | 1.3   | Implement     |       3 |    12 |        6 |  18 | left  |
    |  6 | date      | Y1    |               |         |    12 |          |  12 |       |
    |  7 | milestone | M2    | software      |       5 |    18 |          |  18 |       |
    |----+-----------+-------+---------------+---------+-------+----------+-----+-------|
    |  8 | task      | 2.1   | Surrogate     |       3 |    15 |        6 |  21 | left  |
    |  9 | task      | 2.2   | Implement     |       7 |    21 |        3 |  24 | left  |
    | 10 | milestone | M3    | software      |       8 |    24 |          |  24 |       |
    | 11 | date      | End   |               |         |    24 |          |  24 |       |
    |----+-----------+-------+---------------+---------+-------+----------+-----+-------|
    #+TBLFM: $1=1+@-1::$8=$6+$7::@5$6=@-1$+2::@6$6=@-1$+2::@8$6=@-2$+2::@9$6=3+@4$+2::@10$6=@-1$+2

** Test conditional export

#+source: test_output
#+begin_src octave :results value vector :exports (if (and (boundp 'htmlp) htmlp) "none" "results" )
rand(2)
#+end_src

#+results: test_output
| 0.3982018019389448 | 0.3879818701032038 |
| 0.8053847746148466 | 0.3333630867175288 |
------------------------------------------------------------

Will export nothing to HTML, and the resulting output to other
formats.

Values for 'exports' can be 'both', 'none', 'code' or 'results'; and
there are export flags latexp, htmlp, asciip, docbookp.

I tested the above example, and it "mostly" works. Sometimes not, and
I don't yet know why.

BR
.j.
